---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.MullionProfileContainsMoreThanOneOrOpenLoop
source: html/fd8804c5-4c3b-e347-755d-5f6e8599b60c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.MullionProfileContainsMoreThanOneOrOpenLoop Property

The selected mullion profile either contains more than one profile loop or an open profile loop and cannot be used. Valid profiles can only have a single continuous closed profile loop.

## Syntax (C#)
```csharp
public static FailureDefinitionId MullionProfileContainsMoreThanOneOrOpenLoop { get; }
```